ab-benchmark.txt
orx@OrX:~$ ab -n 6000 -c 100 http://localhost:22/
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 600 requests
Completed 1200 requests
Completed 1800 requests
Completed 2400 requests
Completed 3000 requests
Completed 3600 requests
Completed 4200 requests
Completed 4800 requests
Completed 5400 requests
Completed 6000 requests
Finished 6000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            22

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   0.584 seconds
Complete requests:      6000
Failed requests:        0
Total transferred:      0 bytes
HTML transferred:       0 bytes
Requests per second:    10282.00 [#/sec] (mean)
Time per request:       9.726 [ms] (mean)
Time per request:       0.097 [ms] (mean, across all concurrent requests)
Transfer rate:          0.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       4
Processing:     2    9   2.4      9      16
Waiting:        0    0   0.0      0       0
Total:          5   10   2.2      9      16

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     13
  95%     15
  98%     15
  99%     15
 100%     16 (longest request)
orx@OrX:~$